## 🏗️ Terraform Plan - `dev` Environment

### Workflow Status
| Step | Status |
|------|--------|
| 🖌️ Format | ⚠️ |
| ⚙️ Init | ✅ |
| ✅ Validate | ✅ |
| 📖 Plan | ✅ |
| 🔒 Security Scan | ✅ |

### Resource Changes
| Action | Count |
|--------|-------|
| 🟢 Create | 41 |
| 🟡 Update | 5 |
| 🔴 Delete | 23 |

<details>
<summary>📋 Show Full Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_key_vault_secret.mysql_admin_password will be created
  + resource "azurerm_key_vault_secret" "mysql_admin_password" {
      + content_type            = "password"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "mysql-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.mysql_connection_string will be created
  + resource "azurerm_key_vault_secret" "mysql_connection_string" {
      + content_type            = "connection-string"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "mysql-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.acr.azurerm_container_registry.main must be replaced
-/+ resource "azurerm_container_registry" "main" {
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      ~ encryption                    = [
          - {
              - enabled            = false
              - identity_client_id = ""
              - key_vault_key_id   = ""
            },
        ] -> (known after apply)
      ~ id                            = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.ContainerRegistry/registries/bankingdevacr" -> (known after apply)
      ~ location                      = "eastus2" -> "westus2" # forces replacement
      ~ login_server                  = "bankingdevacr.azurecr.io" -> (known after apply)
        name                          = "bankingdevacr"
      ~ network_rule_set              = [] -> (known after apply)
      ~ retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> (known after apply)
      ~ tags                          = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
      ~ trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.acr.azurerm_monitor_diagnostic_setting.acr[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "acr" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "bankingdevacr-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "ContainerRegistryLoginEvents"
        }
      + enabled_log {
          + category = "ContainerRegistryRepositoryEvents"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + automatic_channel_upgrade           = "stable"
      + azure_policy_enabled                = false
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "banking-dev"
      + fqdn                                = (known after apply)
      + http_application_routing_enabled    = false
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.30"
      + location                            = "westus2"
      + name                                = "banking-dev-aks"
      + node_resource_group                 = "banking-dev-aks-nodes-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "banking-dev-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = (known after apply)
      + workload_identity_enabled           = true

      + auto_scaler_profile {
          + balance_similar_node_groups      = true
          + empty_bulk_delete_max            = "10"
          + expander                         = "least-waste"
          + max_graceful_termination_sec     = "600"
          + max_node_provisioning_time       = "15m"
          + max_unready_nodes                = 3
          + max_unready_percentage           = 45
          + new_pod_scale_up_delay           = "10s"
          + scale_down_delay_after_add       = "10m"
          + scale_down_delay_after_delete    = "10s"
          + scale_down_delay_after_failure   = "3m"
          + scale_down_unneeded              = "10m"
          + scale_down_unready               = "20m"
          + scale_down_utilization_threshold = "0.5"
          + scan_interval                    = "10s"
          + skip_nodes_with_local_storage    = false
          + skip_nodes_with_system_pods      = true
        }

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = []
          + azure_rbac_enabled     = true
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 3
          + max_pods                     = 50
          + min_count                    = 1
          + name                         = "system"
          + node_count                   = 1
          + node_labels                  = {
              + "environment"   = "dev"
              + "nodepool-type" = "system"
            }
          + only_critical_addons_enabled = true
          + orchestrator_version         = (known after apply)
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Managed"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = (known after apply)
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_D2s_v5"
          + vnet_subnet_id               = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-aks-subnet"
          + workload_runtime             = (known after apply)

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + maintenance_window {
          + allowed {
              + day   = "Sunday"
              + hours = [
                  + 0,
                  + 1,
                  + 2,
                  + 3,
                  + 4,
                  + 5,
                ]
            }
        }

      + microsoft_defender {
          + log_analytics_workspace_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip          = "10.100.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "10.100.0.0/16"
          + service_cidrs           = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips      = (known after apply)
              + idle_timeout_in_minutes     = 30
              + managed_outbound_ip_count   = 1
              + managed_outbound_ipv6_count = (known after apply)
              + outbound_ports_allocated    = 0
            }
        }

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.user will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "user" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 5
      + max_pods              = 50
      + min_count             = 1
      + mode                  = "User"
      + name                  = "user"
      + node_count            = 1
      + node_labels           = {
          + "environment"   = "dev"
          + "nodepool-type" = "user"
          + "workload-type" = "general"
        }
      + node_taints           = []
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 128
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = (known after apply)
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D2s_v5"
      + vnet_subnet_id        = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-aks-subnet"

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.aks.azurerm_monitor_diagnostic_setting.aks[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "banking-dev-aks-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "cluster-autoscaler"
        }
      + enabled_log {
          + category = "guard"
        }
      + enabled_log {
          + category = "kube-apiserver"
        }
      + enabled_log {
          + category = "kube-audit"
        }
      + enabled_log {
          + category = "kube-audit-admin"
        }
      + enabled_log {
          + category = "kube-controller-manager"
        }
      + enabled_log {
          + category = "kube-scheduler"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.aks.azurerm_role_assignment.aks_acr_pull[0] will be created
  + resource "azurerm_role_assignment" "aks_acr_pull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_role_assignment.aks_network_contributor must be replaced
-/+ resource "azurerm_role_assignment" "aks_network_contributor" {
      ~ id                               = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-aks-subnet/providers/Microsoft.Authorization/roleAssignments/96f73136-1bae-6436-51e1-3f6d6b273aa8" -> (known after apply)
      ~ name                             = "96f73136-1bae-6436-51e1-3f6d6b273aa8" -> (known after apply)
      ~ principal_id                     = "52fd2aa7-daa2-46a5-8e90-4c5a99caf23e" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.aks.azurerm_user_assigned_identity.aks must be replaced
-/+ resource "azurerm_user_assigned_identity" "aks" {
      ~ client_id           = "fcfbecbc-1a7e-47a7-9d5f-671aec4f7f28" -> (known after apply)
      ~ id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/banking-dev-aks-identity" -> (known after apply)
      ~ location            = "eastus2" -> "westus2" # forces replacement
        name                = "banking-dev-aks-identity"
      ~ principal_id        = "52fd2aa7-daa2-46a5-8e90-4c5a99caf23e" -> (known after apply)
      ~ tags                = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "01/01/2026 14:10:13"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
      ~ tenant_id           = "fdc5ebae-7028-4044-bde5-e0dfd654368b" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault.azurerm_key_vault.main must be replaced
-/+ resource "azurerm_key_vault" "main" {
      ~ access_policy                   = [] -> (known after apply)
      ~ id                              = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.KeyVault/vaults/banking-dev-kv-ejchr9" -> (known after apply)
      ~ location                        = "eastus2" -> "westus2" # forces replacement
        name                            = "banking-dev-kv-ejchr9"
      ~ tags                            = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
      ~ vault_uri                       = "https://banking-dev-kv-ejchr9.vault.azure.net/" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ network_acls {
          ~ default_action             = "Deny" -> "Allow"
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.keyvault.azurerm_monitor_diagnostic_setting.keyvault[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "keyvault" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "banking-dev-kv-ejchr9-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
      + enabled_log {
          + category = "AzurePolicyEvaluationDetails"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.keyvault.azurerm_role_assignment.terraform_admin[0] must be replaced
-/+ resource "azurerm_role_assignment" "terraform_admin" {
      ~ id                               = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.KeyVault/vaults/banking-dev-kv-ejchr9/providers/Microsoft.Authorization/roleAssignments/aa800f94-3c3e-0c37-0239-6f1b28361f56" -> (known after apply)
      ~ name                             = "aa800f94-3c3e-0c37-0239-6f1b28361f56" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> (known after apply)
      ~ scope                            = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.KeyVault/vaults/banking-dev-kv-ejchr9" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.monitoring.azurerm_application_insights.main[0] must be replaced
-/+ resource "azurerm_application_insights" "main" {
      ~ app_id                                = "4e64f2b5-bc54-4b2e-8f3d-6adb78dcd42c" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ id                                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Insights/components/banking-dev-ai" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "eastus2" -> "westus2" # forces replacement
        name                                  = "banking-dev-ai"
      ~ tags                                  = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
      ~ workspace_id                          = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.OperationalInsights/workspaces/banking-dev-law" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.monitoring.azurerm_log_analytics_solution.container_insights[0] must be replaced
-/+ resource "azurerm_log_analytics_solution" "container_insights" {
      ~ id                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.OperationsManagement/solutions/ContainerInsights(banking-dev-law)" -> (known after apply)
      ~ location              = "eastus2" -> "westus2" # forces replacement
      - tags                  = {} -> null
      ~ workspace_resource_id = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.OperationalInsights/workspaces/banking-dev-law" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      ~ plan {
          ~ name      = "ContainerInsights(banking-dev-law)" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.monitoring.azurerm_log_analytics_workspace.main must be replaced
-/+ resource "azurerm_log_analytics_workspace" "main" {
      - cmk_for_query_forced                    = false -> null
      ~ id                                      = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.OperationalInsights/workspaces/banking-dev-law" -> (known after apply)
      - immediate_data_purge_on_30_days_enabled = false -> null
      ~ location                                = "eastus2" -> "westus2" # forces replacement
        name                                    = "banking-dev-law"
      ~ primary_shared_key                      = (sensitive value)
      ~ secondary_shared_key                    = (sensitive value)
      ~ tags                                    = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
      ~ workspace_id                            = "cdaacff2-d8ff-4f12-9cde-db835554f65c" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.monitoring.azurerm_monitor_action_group.critical will be updated in-place
  ~ resource "azurerm_monitor_action_group" "critical" {
        id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Insights/actionGroups/banking-dev-critical-ag"
        name                = "banking-dev-critical-ag"
      ~ tags                = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
        # (4 unchanged attributes hidden)

      - webhook_receiver {
          - name                    = "slack-alerts" -> null
          - service_uri             = (sensitive value) -> null
          - use_common_alert_schema = true -> null
        }
    }

  # module.monitoring.azurerm_monitor_action_group.warning will be updated in-place
  ~ resource "azurerm_monitor_action_group" "warning" {
        id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Insights/actionGroups/banking-dev-warning-ag"
        name                = "banking-dev-warning-ag"
      ~ tags                = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert_v2.container_restarts[0] must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "container_restarts" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Insights/scheduledQueryRules/banking-dev-container-restarts-alert" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
      ~ location                               = "eastus2" -> "westus2" # forces replacement
        name                                   = "banking-dev-container-restarts-alert"
      ~ scopes                                 = [ # forces replacement
          - "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.OperationalInsights/workspaces/banking-dev-law",
        ] -> (known after apply) # forces replacement
      - skip_query_validation                  = false -> null
      ~ tags                                   = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
      - target_resource_types                  = [] -> null
        # (8 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert_v2.error_logs[0] must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "error_logs" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Insights/scheduledQueryRules/banking-dev-error-logs-alert" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
      ~ location                               = "eastus2" -> "westus2" # forces replacement
        name                                   = "banking-dev-error-logs-alert"
      ~ scopes                                 = [ # forces replacement
          - "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.OperationalInsights/workspaces/banking-dev-law",
        ] -> (known after apply) # forces replacement
      - skip_query_validation                  = false -> null
      ~ tags                                   = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
      - target_resource_types                  = [] -> null
        # (8 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.mysql.azurerm_monitor_diagnostic_setting.mysql[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "mysql" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "banking-dev-mysql-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "MySqlAuditLogs"
        }
      + enabled_log {
          + category = "MySqlSlowLogs"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.mysql.azurerm_mysql_flexible_database.main["bankingdb"] will be created
  + resource "azurerm_mysql_flexible_database" "main" {
      + charset             = "utf8mb4"
      + collation           = "utf8mb4_unicode_ci"
      + id                  = (known after apply)
      + name                = "bankingdb"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
    }

  # module.mysql.azurerm_mysql_flexible_server.main will be created
  + resource "azurerm_mysql_flexible_server" "main" {
      + administrator_login           = "mysqladmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + delegated_subnet_id           = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-db-subnet"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westus2"
      + name                          = "banking-dev-mysql"
      + private_dns_zone_id           = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "banking-dev-rg"
      + sku_name                      = "B_Standard_B1ms"
      + tags                          = (known after apply)
      + version                       = "8.0.21"
      + zone                          = "1"

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 2
          + start_minute = 0
        }

      + storage {
          + auto_grow_enabled  = true
          + io_scaling_enabled = false
          + iops               = 360
          + size_gb            = 32
        }
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.audit_log[0] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "audit_log" {
      + id                  = (known after apply)
      + name                = "audit_log_enabled"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.audit_log_events[0] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "audit_log_events" {
      + id                  = (known after apply)
      + name                = "audit_log_events"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "CONNECTION,DDL,DML,DCL"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.log_queries_not_using_indexes will be created
  + resource "azurerm_mysql_flexible_server_configuration" "log_queries_not_using_indexes" {
      + id                  = (known after apply)
      + name                = "log_queries_not_using_indexes"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.long_query_time will be created
  + resource "azurerm_mysql_flexible_server_configuration" "long_query_time" {
      + id                  = (known after apply)
      + name                = "long_query_time"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "2"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.require_ssl will be created
  + resource "azurerm_mysql_flexible_server_configuration" "require_ssl" {
      + id                  = (known after apply)
      + name                = "require_secure_transport"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.slow_query_log will be created
  + resource "azurerm_mysql_flexible_server_configuration" "slow_query_log" {
      + id                  = (known after apply)
      + name                = "slow_query_log"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.tls_version will be created
  + resource "azurerm_mysql_flexible_server_configuration" "tls_version" {
      + id                  = (known after apply)
      + name                = "tls_version"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "TLSv1.2,TLSv1.3"
    }

  # module.networking.azurerm_nat_gateway.main[0] must be replaced
-/+ resource "azurerm_nat_gateway" "main" {
      ~ id                      = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/natGateways/banking-dev-nat-gateway" -> (known after apply)
      ~ location                = "eastus2" -> "westus2" # forces replacement
        name                    = "banking-dev-nat-gateway"
      ~ resource_guid           = "9d86a9ab-8408-4732-a1bb-15c74fe322a8" -> (known after apply)
      ~ tags                    = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.networking.azurerm_nat_gateway_public_ip_association.main[0] must be replaced
-/+ resource "azurerm_nat_gateway_public_ip_association" "main" {
      ~ id                   = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/natGateways/banking-dev-nat-gateway|/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/publicIPAddresses/banking-dev-nat-pip" -> (known after apply)
      ~ nat_gateway_id       = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/natGateways/banking-dev-nat-gateway" # forces replacement -> (known after apply) # forces replacement
      ~ public_ip_address_id = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/publicIPAddresses/banking-dev-nat-pip" # forces replacement -> (known after apply) # forces replacement
    }

  # module.networking.azurerm_network_security_group.aks must be replaced
-/+ resource "azurerm_network_security_group" "aks" {
      ~ id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/networkSecurityGroups/banking-dev-aks-nsg" -> (known after apply)
      ~ location            = "eastus2" -> "westus2" # forces replacement
        name                = "banking-dev-aks-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "443"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowHTTPSInbound"
              - priority                                   = 100
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowHTTPInbound"
              - priority                                   = 101
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      ~ tags                = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.networking.azurerm_network_security_group.database must be replaced
-/+ resource "azurerm_network_security_group" "database" {
      ~ id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/networkSecurityGroups/banking-dev-db-nsg" -> (known after apply)
      ~ location            = "eastus2" -> "westus2" # forces replacement
        name                = "banking-dev-db-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "3306"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowMySQLFromAKS"
              - priority                                   = 100
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "10.0.0.0/22"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Deny"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "DenyAllInbound"
              - priority                                   = 4096
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      ~ tags                = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.networking.azurerm_private_dns_zone.acr will be updated in-place
  ~ resource "azurerm_private_dns_zone" "acr" {
        id                                                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io"
        name                                                  = "privatelink.azurecr.io"
      ~ tags                                                  = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.networking.azurerm_private_dns_zone.keyvault will be updated in-place
  ~ resource "azurerm_private_dns_zone" "keyvault" {
        id                                                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
        name                                                  = "privatelink.vaultcore.azure.net"
      ~ tags                                                  = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.networking.azurerm_private_dns_zone.mysql will be updated in-place
  ~ resource "azurerm_private_dns_zone" "mysql" {
        id                                                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com"
        name                                                  = "privatelink.mysql.database.azure.com"
      ~ tags                                                  = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.acr must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "acr" {
      ~ id                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/virtualNetworkLinks/acr-vnet-link" -> (known after apply)
        name                  = "acr-vnet-link"
      ~ tags                  = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
      ~ virtual_network_id    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.keyvault must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "keyvault" {
      ~ id                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/keyvault-vnet-link" -> (known after apply)
        name                  = "keyvault-vnet-link"
      ~ tags                  = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
      ~ virtual_network_id    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.mysql must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "mysql" {
      ~ id                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com/virtualNetworkLinks/mysql-vnet-link" -> (known after apply)
        name                  = "mysql-vnet-link"
      ~ tags                  = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
      ~ virtual_network_id    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_public_ip.nat[0] must be replaced
-/+ resource "azurerm_public_ip" "nat" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/publicIPAddresses/banking-dev-nat-pip" -> (known after apply)
      ~ ip_address              = "172.193.69.85" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ location                = "eastus2" -> "westus2" # forces replacement
        name                    = "banking-dev-nat-pip"
      ~ tags                    = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.networking.azurerm_subnet_nat_gateway_association.aks[0] must be replaced
-/+ resource "azurerm_subnet_nat_gateway_association" "aks" {
      ~ id             = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-aks-subnet" -> (known after apply)
      ~ nat_gateway_id = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/natGateways/banking-dev-nat-gateway" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.networking.azurerm_subnet_network_security_group_association.aks must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "aks" {
      ~ id                        = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-aks-subnet" -> (known after apply)
      ~ network_security_group_id = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/networkSecurityGroups/banking-dev-aks-nsg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.networking.azurerm_subnet_network_security_group_association.database must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "database" {
      ~ id                        = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-db-subnet" -> (known after apply)
      ~ network_security_group_id = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/networkSecurityGroups/banking-dev-db-nsg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.networking.azurerm_virtual_network.main must be replaced
-/+ resource "azurerm_virtual_network" "main" {
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "cc68e77e-ead5-4f70-a64d-f743841af5f0" -> (known after apply)
      ~ id                      = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet" -> (known after apply)
      ~ location                = "eastus2" -> "westus2" # forces replacement
        name                    = "banking-dev-vnet"
      ~ subnet                  = [
          - {
              - address_prefix = "10.0.0.0/22"
              - id             = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-aks-subnet"
              - name           = "banking-dev-aks-subnet"
              - security_group = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/networkSecurityGroups/banking-dev-aks-nsg"
            },
          - {
              - address_prefix = "10.0.4.0/24"
              - id             = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-db-subnet"
              - name           = "banking-dev-db-subnet"
              - security_group = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/networkSecurityGroups/banking-dev-db-nsg"
            },
          - {
              - address_prefix = "10.0.5.0/24"
              - id             = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-appgw-subnet"
              - name           = "banking-dev-appgw-subnet"
              - security_group = ""
            },
          - {
              - address_prefix = "10.0.6.0/24"
              - id             = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-pe-subnet"
              - name           = "banking-dev-pe-subnet"
              - security_group = ""
            },
        ] -> (known after apply)
      ~ tags                    = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.resource_group.azurerm_resource_group.main must be replaced
-/+ resource "azurerm_resource_group" "main" {
      ~ id       = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg" -> (known after apply)
      ~ location = "eastus2" -> "westus2" # forces replacement
        name     = "banking-dev-rg"
      ~ tags     = {
          - "CostCenter"  = "development"
          - "CreatedDate" = "2026-01-01T14:10:13Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> (known after apply)
    }

Plan: 41 to add, 5 to change, 23 to destroy.

Changes to Outputs:
  ~ acr_login_server                       = "bankingdevacr.azurecr.io" -> (known after apply)
  + aks_cluster_fqdn                       = (known after apply)
  ~ application_insights_connection_string = (sensitive value)
  ~ keyvault_uri                           = "https://banking-dev-kv-ejchr9.vault.azure.net/" -> (known after apply)
  ~ log_analytics_workspace_id             = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.OperationalInsights/workspaces/banking-dev-law" -> (known after apply)
  + mysql_fqdn                             = (known after apply)

```

</details>

---
*Triggered by @boateng0303 | Workflow: `Terraform PR Validation` | [View Logs](https://github.com/boateng0303/secure-bankapp-devsecops/actions/runs/20640297638)*